Revit 2026 API

# ReferenceType Enumeration

---

Reference types of curve element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ReferenceType
```
```vb
Public Enumeration ReferenceType
```
```cpp
public enum class ReferenceType
```
```fsharp
type ReferenceType
```

| Member name | Value | Description |
| --- | --- | --- |
| None | 0 |  |
| StrongReference | 2 |  |
| WeakReference | 1 |  |

#### Reference

Autodesk.Revit.DB Namespace